GopalSaraf/Practicals/PSDL/include/proc/pic16f18026.h
// Register: RC0I2C
#define RC0I2C RC0I2C
extern volatile unsigned char           RC0I2C              __at(0x1EE9);
#ifndef _LIB_BUILD
asm("RC0I2C equ 01EE9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TH                     :2;
        unsigned                        :2;
        unsigned PU                     :2;
        unsigned SLEW                   :1;
    };
} RC0I2Cbits_t;
extern volatile RC0I2Cbits_t RC0I2Cbits __at(0x1EE9);
// bitfield macros
#define _RC0I2C_TH_POSN                                     0x0
#define _RC0I2C_TH_POSITION                                 0x0
#define _RC0I2C_TH_SIZE                                     0x2
#define _RC0I2C_TH_LENGTH                                   0x2
#define _RC0I2C_TH_MASK                                     0x3
#define _RC0I2C_PU_POSN                                     0x4
#define _RC0I2C_PU_POSITION                                 0x4
#define _RC0I2C_PU_SIZE                                     0x2
#define _RC0I2C_PU_LENGTH                                   0x2
#define _RC0I2C_PU_MASK                                     0x30
#define _RC0I2C_SLEW_POSN                                   0x6
#define _RC0I2C_SLEW_POSITION                               0x6
#define _RC0I2C_SLEW_SIZE                                   0x1
#define _RC0I2C_SLEW_LENGTH                                 0x1
#define _RC0I2C_SLEW_MASK                                   0x40

// Register: RC1I2C
#define RC1I2C RC1I2C
extern volatile unsigned char           RC1I2C              __at(0x1EEA);
#ifndef _LIB_BUILD
asm("RC1I2C equ 01EEAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TH                     :2;
        unsigned                        :2;
        unsigned PU                     :2;
        unsigned SLEW                   :1;
    };
} RC1I2Cbits_t;
extern volatile RC1I2Cbits_t RC1I2Cbits __at(0x1EEA);
// bitfield macros
#define _RC1I2C_TH_POSN                                     0x0
#define _RC1I2C_TH_POSITION                                 0x0
#define _RC1I2C_TH_SIZE                                     0x2
#define _RC1I2C_TH_LENGTH                                   0x2
#define _RC1I2C_TH_MASK                                     0x3
#define _RC1I2C_PU_POSN                                     0x4
#define _RC1I2C_PU_POSITION                                 0x4
#define _RC1I2C_PU_SIZE                                     0x2
#define _RC1I2C_PU_LENGTH                                   0x2
#define _RC1I2C_PU_MASK                                     0x30
#define _RC1I2C_SLEW_POSN                                   0x6
#define _RC1I2C_SLEW_POSITION                               0x6
#define _RC1I2C_SLEW_SIZE                                   0x1
#define _RC1I2C_SLEW_LENGTH                                 0x1
#define _RC1I2C_SLEW_MASK                                   0x40

// Register: RC4I2C
#define RC4I2C RC4I2C
extern volatile unsigned char           RC4I2C              __at(0x1EEC);
#ifndef _LIB_BUILD
asm("RC4I2C equ 01EECh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TH                     :2;
        unsigned                        :2;
        unsigned PU                     :2;
        unsigned SLEW                   :1;
    };
} RC4I2Cbits_t;
extern volatile RC4I2Cbits_t RC4I2Cbits __at(0x1EEC);
// bitfield macros
#define _RC4I2C_TH_POSN                                     0x0
#define _RC4I2C_TH_POSITION                                 0x0
#define _RC4I2C_TH_SIZE                                     0x2
#define _RC4I2C_TH_LENGTH                                   0x2
#define _RC4I2C_TH_MASK                                     0x3
#define _RC4I2C_PU_POSN                                     0x4
#define _RC4I2C_PU_POSITION                                 0x4
#define _RC4I2C_PU_SIZE                                     0x2
#define _RC4I2C_PU_LENGTH                                   0x2
#define _RC4I2C_PU_MASK                                     0x30
#define _RC4I2C_SLEW_POSN                                   0x6
#define _RC4I2C_SLEW_POSITION                               0x6
#define _RC4I2C_SLEW_SIZE                                   0x1
#define _RC4I2C_SLEW_LENGTH                                 0x1
#define _RC4I2C_SLEW_MASK                                   0x40

// Register: RC5I2C
#define RC5I2C RC5I2C
extern volatile unsigned char           RC5I2C              __at(0x1EED);
#ifndef _LIB_BUILD
asm("RC5I2C equ 01EEDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TH                     :2;
        unsigned                        :2;
        unsigned PU                     :2;
        unsigned SLEW                   :1;
    };
} RC5I2Cbits_t;
extern volatile RC5I2Cbits_t RC5I2Cbits __at(0x1EED);
// bitfield macros
#define _RC5I2C_TH_POSN                                     0x0
#define _RC5I2C_TH_POSITION                                 0x0
#define _RC5I2C_TH_SIZE                                     0x2
#define _RC5I2C_TH_LENGTH                                   0x2
#define _RC5I2C_TH_MASK                                     0x3
#define _RC5I2C_PU_POSN                                     0x4
#define _RC5I2C_PU_POSITION                                 0x4
#define _RC5I2C_PU_SIZE                                     0x2
#define _RC5I2C_PU_LENGTH                                   0x2
#define _RC5I2C_PU_MASK                                     0x30
#define _RC5I2C_SLEW_POSN                                   0x6
#define _RC5I2C_SLEW_POSITION                               0x6
#define _RC5I2C_SLEW_SIZE                                   0x1
#define _RC5I2C_SLEW_LENGTH                                 0x1
#define _RC5I2C_SLEW_MASK                                   0x40

// Register: UMTOAP
#define UMTOAP UMTOAP
extern volatile unsigned char           UMTOAP              __at(0x1F0C);
#ifndef _LIB_BUILD
asm("UMTOAP equ 01F0Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned UMTOAP                 :8;
    };
} UMTOAPbits_t;
extern volatile UMTOAPbits_t UMTOAPbits __at(0x1F0C);
// bitfield macros
#define _UMTOAP_UMTOAP_POSN                                 0x0
#define _UMTOAP_UMTOAP_POSITION                             0x0
#define _UMTOAP_UMTOAP_SIZE                                 0x8
#define _UMTOAP_UMTOAP_LENGTH                               0x8
#define _UMTOAP_UMTOAP_MASK                                 0xFF

// Register: UMTOAL
#define UMTOAL UMTOAL
extern volatile unsigned char           UMTOAL              __at(0x1F0D);
#ifndef _LIB_BUILD
asm("UMTOAL equ 01F0Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned UMTOAL                 :8;
    };
} UMTOALbits_t;
